Процедура ОтправитьУведомление_Android(ТекстСообщения,Данные,ИдентификаторПолучателя) Экспорт 
	Попытка
		
		Если ТекстСообщения = "" ИЛИ Данные = "" Тогда
			Возврат;
		КонецЕсли;
		
		СоединениеHTTP = Новый HTTPСоединение("android.googleapis.com",443,,,,,Новый ЗащищенноеСоединениеOpenSSL(,));
		
		СтруктураЗапроса = Новый Соответствие;
		СтруктураЗапроса.Вставить("Content-Type","application/x-www-form-urlencoded;charset=UTF-8");
		СтруктураЗапроса.Вставить("Authorization","key=AIzaSyDZfIS6M0eaUHFY8f6RpGcibYSLOg4WM8k");
		
		ЗапросHTTP = Новый HTTPЗапрос("gcm/send",СтруктураЗапроса);
		
		Тело = "registration_id="+ИдентификаторПолучателя.ИдентификаторУстройства+
		"&data.data="+КодироватьСтроку(Данные,СпособКодированияСтроки.URLВКодировкеURL)+
		"&data.text="+КодироватьСтроку(ТекстСообщения,СпособКодированияСтроки.URLВКодировкеURL)+
		"&data.base="+ИдентификаторПолучателя.ИдентификаторИнформационнойБазы+
		"&data.sound="+"default"+
		"&delay_while_idle="+"true";
		
		ЗапросHTTP.УстановитьТелоИзСтроки(Тело,"UTF-8");
		Ответ = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
		
		Если не Ответ.КодСостояния = 200 Тогда
			Сообщить("PUSH "+"Ошибка отправки PUSH Кодсостояния: "+Ответ.КодСостояния+Символы.ПС+Ответ.ПолучитьТелоКакСтроку());
		КонецЕсли;
				
	Исключение
		Сообщить("PUSH"+ОписаниеОшибки());
	КонецПопытки;	
КонецПроцедуры
