
&НаКлиенте
Процедура ПрочитатьДанныеНаСервере()
	урл="https://docs.google.com/spreadsheets/d/15KQbrs0CQw6jGZNjvFFwh2pHbLQST0k1KPQVboydkJI/edit?usp=sharing";
	
	Сервер = "docs.google.com";
	Ресурс = "/spreadsheets/d/e/2PACX-1vT_Eb2nCDM1HXp-nopDGtttGgkvXsUX-XbgHVTp-PSppIU1Czvai5gWRQzWnUYPBXDYLI_f-StM5y-T/pub?gid=1961409282&single=true&output=csv";
	
	Соединение = Новый HTTPСоединение(Сервер,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки  = Новый Соответствие;	
	Заголовки.Вставить("Content-Type","application/x-www-form-urlencoded");	
	ЗапросHTTP = Новый HTTPЗапрос(Ресурс,Заголовки);
	ФайлCSV = ПолучитьИмяВременногоФайла();
	Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP,ФайлCSV);
	
	Если Ответ.КодСостояния = 200 Тогда
		ЗагружаемыйФайл = Новый ЧтениеТекста(ФайлCSV, КодировкаТекста.UTF8); 
		ТекСтрока = ЗагружаемыйФайл.ПрочитатьСтроку();
		ТекСтрока = ЗагружаемыйФайл.ПрочитатьСтроку();
		НомерСтроки = 0;
		Пока ТекСтрока <> Неопределено Цикл 
			НомерСтроки = НомерСтроки + 1;
			ТекСтрока = СтрЗаменить(ТекСтрока,",",Символы.ПС);
			КоличествоСтрок = СтрЧислоСтрок(ТекСтрока);
			стрЗатраты = "";
			Если КоличествоСтрок>2 и НЕ НомерСтроки=10 Тогда
				Для сч = 1 По КоличествоСтрок-1 Цикл
					стрЗатраты = стрЗатраты + СтрПолучитьСтроку(ТекСтрока,сч);	
				КонецЦикла;
			Иначе
				стрЗатраты = СтрПолучитьСтроку(ТекСтрока,1); 
				Если НомерСтроки=10 Тогда
					КоличествоСтрок = КоличествоСтрок - 1;	
				КонецЕсли;
			КонецЕсли;
			стрСумма   = СтрПолучитьСтроку(ТекСтрока,КоличествоСтрок);
			НоваяСтрока = Объект.тчЗатраты.Добавить();
			НоваяСтрока.ИмяЗатрат = стрЗатраты;
			НоваяСтрока.Сумма     = стрСумма;
			ТекСтрока = ЗагружаемыйФайл.ПрочитатьСтроку();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПрочитатьДанные(Команда)
	ПрочитатьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры


