
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ТекущийЭлемент = Элементы.ШК;	
КонецПроцедуры

&НаКлиенте
Процедура ШКПриИзменении(Элемент)	
	ЭтаФорма.ТекущийЭлемент = Элементы.ШК;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Элементы.ДекорацияВН.Заголовок = "Внешнее событие ШК: "+Данные;
КонецПроцедуры

&НаКлиенте
Процедура ШКОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элементы.ДекорацияШК.Заголовок = "ОкончаниеВвода ШК: "+Текст;
	Элементы.Декорация1.Заголовок = "ПараметрыПолученияДанных ШК: "+ПараметрыПолученияДанных.СтрокаПоиска;
	ЭтаФорма.ТекущийЭлемент = Элементы.ШК;
КонецПроцедуры
