Процедура ПодключитьОбработчикУведоленияИзОбщегоМодуля() Экспорт 
	#Если МобильноеПриложениеКлиент Тогда	
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикPush",PushКлиент);
		ДоставляемыеУведомления.ПодключитьОбработчикУведомлений(ОписаниеОповещения);
	#КонецЕсли
КонецПроцедуры

Процедура ОбработчикPush(Уведолмение, Локальное, Показано, ДопПараметр) Экспорт 
	Сообщить(Уведолмение.Текст+Символы.ПС+Уведолмение.Данные);
КонецПроцедуры

Процедура ОбновитьИдентификаторПодписчика() Экспорт 
	#Если МобильноеПриложениеКлиент Тогда
		Попытка
			Идентификатор = ДоставляемыеУведомления.ПолучитьИдентификаторПодписчикаУведомлений("805052403427");
			PushВызовСервера.ОбновитьИдентификаторПодписчика(Идентификатор);
		Исключение
		КонецПопытки;
	#КонецЕсли
КонецПроцедуры
