
&НаКлиенте
Процедура НабратьТелефон(Команда)
	ПозвонитьПоНомеру(Объект.Телефон);
КонецПроцедуры

&НаКлиенте
Процедура ПозвонитьПоНомеру(НомерТелефона)
	
	Если ПустаяСтрока(СокрЛП(НомерТелефона)) Тогда
		Возврат;
	КонецЕсли;
			
	#Если МобильноеПриложениеКлиент Тогда
	Если СредстваТелефонии.ПоддерживаетсяНаборНомера() Тогда
	    СредстваТелефонии.НабратьНомер(НомерТелефона, Истина);
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Функция ОбработатьТелефон(Телефон)
	Телефон = СтрЗаменить(Телефон,"-","");
	Телефон = СтрЗаменить(Телефон," ","");
	Телефон = СокрЛП(Телефон);
	
	Возврат Телефон;
КонецФункции

&НаКлиенте
Процедура НабратьТелефон1(Команда)
	ПозвонитьПоНомеру(Объект.Телефон1);
КонецПроцедуры

&НаКлиенте
Процедура НабратьТелефон2(Команда)
	ПозвонитьПоНомеру(Объект.Телефон2);
КонецПроцедуры

&НаКлиенте
Процедура НабратьТелефон3(Команда)
	ПозвонитьПоНомеру(Объект.Телефон3);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеНаПочту()
	Если ЗначениеЗаполнено(Объект.Почта) Тогда
		ТемаСообщения = "Введите тему сообщения!";
		ТекстСообщения = "Введите текст сообщения!";
		ЗапуститьПриложение("mailto:" + СокрЛП(Объект.Почта) + "?subject=" + ТемаСообщения + "&body=" + ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаписатьНаПочту(Команда)
	ОтправитьСообщениеНаПочту();
КонецПроцедуры
