
&НаКлиенте
Процедура Создать(Команда)
	#Если МобильноеПриложениеКлиент Тогда 	
		Уведомление = Новый ДоставляемоеУведомление;
		Уведомление.Заголовок = СокрЛП(Объект.Наименование);
		Уведомление.Текст     = СокрЛП(Объект.ТекстСообщения);
		Уведомление.Данные    = 2017;
		Уведомление.ДатаПоявленияУниверсальноеВремя = ПолучитьДатаПоявленияУниверсальноеВремяНаСервере(Объект.ДатаУведомления,"Etc/GMT-3");
		Уведомление.ЗвуковоеОповещение = ЗвуковоеОповещение.ПоУмолчанию;
		ДоставляемыеУведомления.ДобавитьЛокальноеУведомление(Уведомление);
		
		ЭтотОбъект.Записать();
	#Иначе     
	    СообщениеПользователю = Новый СообщениеПользователю;
	    СообщениеПользователю.Текст = "Это обычное сообщение";
	    СообщениеПользователю.Сообщить();
	#КонецЕсли	
	//Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьДатаПоявленияУниверсальноеВремяНаСервере(Срок, ЧасовойПояс) 
	УВ = УниверсальноеВремя(Срок); 
    Возврат УВ;
КонецФункции

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Объект.ТекстСообщения = "Внешнее событие ";
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если МобильноеПриложениеКлиент Тогда
		Параметр = Неопределено;
	    ОП = Новый ОписаниеОповещения("КрутойОбработчик",ЭтаФорма,Параметр);
	    ДоставляемыеУведомления.ПодключитьОбработчикУведомлений(ОП);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура КрутойОбработчик(Уведомление,Локальное,Показано,ДопПараметры) Экспорт
    Сообщить(Уведомление.Текст);
    Объект.ТекстСообщения = "Внешнее событие "+Уведомление.Текст;
КонецПроцедуры
