Функция ПолучитьДанныеФото(ТоварСсылка, UIDкартинкиТовара) Экспорт 
	Рег = РегистрыСведений.ДанныеМультимедиа.СоздатьНаборЗаписей();
	Рег.Отбор.Товар.Установить(ТоварСсылка);
	Рег.Отбор.UID.Установить(UIDкартинкиТовара);
	Рег.Прочитать();
	Если Рег.Количество() = 0 Тогда Возврат Неопределено КонецЕсли;
	ДДФайла = Рег[0].Данные.Получить();	
	
	Возврат ДДФайла;
КонецФункции

Процедура УдалитьФото(ТоварСсылка, UIDкартинкиТовара) Экспорт 
	НаборЗаписей = РегистрыСведений.ДанныеМультимедиа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Товар.Установить(ТоварСсылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры